; domain
(define (domain monkey-banana)
  (:requirements :strips)
  
  (:predicates
    ; Location predicates
    (at ?monkey ?location)
    (box-at ?box ?location)
    (banana-at ?banana ?location)
    
    ; Height/level predicates
    (on-ground ?monkey)
    (on-box ?monkey ?box)
    (box-on-ground ?box)
    (banana-on-ground ?banana)
    (banana-on-box ?banana ?box)
    
    ; Adjacency for movement
    (adjacent ?loc1 ?loc2)
    
    ; Goal state
    (has-banana ?monkey ?banana)
  )
  
  (:action move
    :parameters (?monkey ?from ?to)
    :precondition (and (at ?monkey ?from) (adjacent ?from ?to) (on-ground ?monkey))
    :effect (and (at ?monkey ?to) (not (at ?monkey ?from)))
  )
  
  (:action climb_on
    :parameters (?monkey ?box ?location)
    :precondition (and (at ?monkey ?location) (box-at ?box ?location) (on-ground ?monkey))
    :effect (and (on-box ?monkey ?box) (not (on-ground ?monkey)))
  )
  
  (:action climb_off
    :parameters (?monkey ?box ?location)
    :precondition (and (on-box ?monkey ?box) (box-at ?box ?location))
    :effect (and (on-ground ?monkey) (not (on-box ?monkey ?box)))
  )
  
  (:action push_box
    :parameters (?monkey ?box ?from ?to)
    :precondition (and (at ?monkey ?from) (box-at ?box ?from) (adjacent ?from ?to) (on-ground ?monkey))
    :effect (and (box-at ?box ?to) (not (box-at ?box ?from)))
  )
  
  (:action grab_banana_from_ground
    :parameters (?monkey ?banana ?location)
    :precondition (and 
      (at ?monkey ?location) 
      (banana-at ?banana ?location)
      (on-ground ?monkey)
      (banana-on-ground ?banana)
    )
    :effect (has-banana ?monkey ?banana)
  )
  
  (:action grab_banana_from_box
    :parameters (?monkey ?banana ?box ?location)
    :precondition (and 
      (at ?monkey ?location) 
      (banana-at ?banana ?location)
      (on-ground ?monkey)
      (banana-on-box ?banana ?box)
      (box-at ?box ?location)
    )
    :effect (has-banana ?monkey ?banana)
  )
)

; problem
(define (problem monkey-banana-problem)
  (:domain monkey-banana)

  (:objects
    monkey
    banana
    box1 box2
    L1 L2 L3 L4  ; abstract locations
  )

  (:init
    ;; Monkey starts at L1
    (at monkey L1)
    (on-ground monkey)

    ;; Boxes
    (box-at box1 L2)
    (box-on-ground box1)

    (box-at box2 L3)
    (box-on-ground box2)

    ;; Banana
    (banana-at banana L4)
    (banana-on-ground banana)

    ;; Relative movement structure
    ;; Monkey must traverse L1 → L2 → L3 → L4
    (adjacent L1 L2)
    (adjacent L2 L1)

    (adjacent L2 L3)
    (adjacent L3 L2)

    (adjacent L3 L4)
    (adjacent L4 L3)
  )

  (:goal
    (has-banana monkey banana)
  )
)

; plan
1. (move monkey l1 l2)
   deleted: (at monkey l1)
   added: (at monkey l2)
   goals met: 0 of 1
2. (move monkey l2 l3)
   deleted: (at monkey l2)
   added: (at monkey l3)
   goals met: 0 of 1
3. (move monkey l3 l4)
   deleted: (at monkey l3)
   added: (at monkey l4)
   goals met: 0 of 1
4. (grab_banana_from_ground monkey banana l4)
   added: (has-banana monkey banana)
   goals met: 1 of 1
